dongfangqing/MetroCard/src/MealCard_STm32/User/RC522/rc522_driver.c
	return status;
} 

/***********************************
**函数功能：RC522初始化
***********************************/
void RC522_Init(void)
{
	MF522_io_init(); 	//端口初始化
	PcdReset(); 	//复位RC522
	PcdAntennaOff(); 	//关闭天线 
	PcdAntennaOn();  	//打开天线
	M500PcdConfigISOType( 'A' );	//设置RC522的工作方式 
	delay_ms(100);	
	delay_ms(100);

}



/*************************************************************************************/
/*************************************应用程序实现************************************/
/*************************************************************************************/

/**************************************************************
**函数功能：操作卡--扫描卡、防冲撞、选卡、验证A、B区密码
**参		数：g_ucTempbuf---------卡片类型代码
**				serial_number-------卡片序列号存储
**返回	值：ret == 5时，所有操作正确，否则都是错误操作
**************************************************************/
int Card_handle(unsigned char* g_ucTempbuf,unsigned char* serial_number)
{
	u8 status;
	u8 temp;
	int i = 0;
	int ret = 0;
	unsigned char  DefaultKey[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
	
	status = PcdRequest(PICC_REQALL,g_ucTempbuf);/*扫描卡*/
	if(status==0)	//扫描成功
	{	
//		printf("卡的类型:");
		for(i=0;i<2;i++)
		{	
			temp=g_ucTempbuf[i];
			printf("%X",temp);					
		}
		ret = 1;
	}
	else
	{
		//再扫描一次
		status = PcdRequest(PICC_REQALL,g_ucTempbuf);/*扫描卡*/
		if(status==0)	//扫描成功
		{	
	//		printf("卡的类型:");
			for(i=0;i<2;i++)
			{	
				temp=g_ucTempbuf[i];
//				printf("%X",temp);					
			}
			ret = 1;
		}
		else
		{
//			printf("\r\n扫描失败\r\n");
			ret = -1;
		}
	}
		
	status = PcdAnticoll(g_ucTempbuf);/*防冲撞*/ 
	if(status == 0)	//读序列号成功
	{ 
	//	printf("\r\n卡的序号");
		for(i=0;i<4;i++)
		{
			temp=g_ucTempbuf[i];
//			printf("%X",temp);		
			if(serial_number != NULL)
			{
				serial_number[i] = temp;
			}
		}
		ret += 1;
	}
	else
	{
		ret -= 1;
//		printf("\r\n防冲撞失败\r\n");
	}
	
	status = PcdSelect(g_ucTempbuf);//选定卡片
	if(status == 0)
	{
		ret += 1;
//		printf("\r\n卡选定成功\n");
	} 
	else 
	{
//		printf("\r\n卡选定失败\r\n");
		ret -= 1;
	}
	
	if(ret == 3)
	{
		//校验A密码
		status = PcdAuthState(PICC_AUTHENT1A, 1, DefaultKey, g_ucTempbuf);//验证卡片密码    
		if (status == MI_OK)
		{   
			ret += 1;
//			printf("校验A密码成功\r\n");
		}
		else 
		{
			ret -= 1;
//			printf("校验A密码失败\r\n");
		}
		
		//校验B密码
		status = PcdAuthState(PICC_AUTHENT1B, 1, DefaultKey, g_ucTempbuf);//验证卡片密码    
		if (status == MI_OK)
		{   
			ret += 1;
//			printf("校验B密码成功\r\n");
		}
		else 
		{
			ret -= 1;
//			printf("校验B密码失败\r\n");
		}
	}
	
	return  ret;
}

/**************************************
**只使用扇区0，块1----存放系统生成的编号
**					   块2-----存放卡中余额
**************************************/
/*************************************************
**函数功能：办理新卡
**					将生成用户编号写入扇区0
**					块1中，将第一次金额写入
**					块2中
**参		数：g_ucTempbuf---------卡片类型代码
**					papers--------------客户信息号
**					money---------------第一次充值金额
**					serial_number-------卡的序列号，返回和用户信息一起登记
**					没张IC卡都有一个唯一的序列号，作为与用户绑定
**返回	值：只有当ret == 2时，才能认为操作成功了，否则操作失败！
***************************************************/
int Card_New(unsigned char* g_ucTempbuf,unsigned char* papers,
						unsigned char* money,unsigned char* serial_number)
{
	int ret = 0;
	u8 status = 0;
	u8 buff[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
	
	//扫描卡等等 ,将卡的序列号存放在serial_number
	status = Card_handle(g_ucTempbuf,serial_number);
	if(status == 5)		//只有扫描成功······一直到密码验证成功，才进行信息的写入
	{
		status = PcdWrite(1, buff);	//先将块清0
		status = PcdWrite(1, papers);	//将客户信息编号写入块1
		if(status==0)
		{
			ret += 1;
	//		printf("客户信息写入成功\r\n");
		}
		else
		{
			ret -= 1;
//			printf("客户信息写入失败\r\n");
		}
		
		status = PcdWrite(2, buff);	//先将块清0
		status = PcdWrite(2, money);	//将客户信息编号写入块1
		if(status==0)
		{
			ret += 1;

		}
		else
		{
			ret -= 1;

		}
	}
	
	return ret;
}




/*********************************
**函数功能：充值卡-----从扇区0
**					块2加值
**参		数：g_ucTempbuf---------卡片类型代码
**					money---------------充值金额
**返回	值：ret == 1时，表示充值成功
*********************************/
int Card_Topup(unsigned char* g_ucTempbuf,int money)
{
	int ret= 0;
	u8 status = 0;
	u8 raw_money[16];
	int i = 0;
	int temp = 0;
	
	PcdReset();
	while(Card_Look_Balance(g_ucTempbuf) != 1);		//将卡内余额读出
	for(i=0;i<4;i++)		//金额用到4字节
	{
		raw_money[i]=g_ucTempbuf[i];
		printf("%X",raw_money[i]);
	}	
	printf("\r\n");
	//数据处理,将读到的数据转换为一个32位的int型整数
	temp = raw_money[3];//将最高字节给temp
	temp <<= 8;			//temp左移8位
	temp |= raw_money[2];
	temp <<= 8;
	temp |= raw_money[1];
	temp <<= 8;
	temp |= raw_money[0];
	
	//数据已经还原,加上充值金额
	temp += money;
	
	//又将数据还原成4字节大小的char型数组
	raw_money[0] = 0xff & temp;
	temp >>= 8;
	raw_money[1] = 0xff & temp;
	temp >>= 8;
	raw_money[2] = 0xff & temp;
	temp >>= 8;
	raw_money[3] = 0xff & temp;
	
	//将数组没用用到的12字节配置为0
	for(i = 4;i < 16;i++)
	{
		raw_money[i] = 0;
	}
	
	//将数据写到块1中
	status = PcdWrite(2, raw_money);	//将金额写入块2
	if(status==0)
	{
		ret = 1;
		
	}
	else
	{
		ret = -1;
	
	}
	
	return ret;
}


/**********************************
**函数功能：刷卡扣款-----从扇区0
**					块2减值
**参		数：g_ucTempbuf---------卡片类型代码
**					money------------扣除金额
**返回	值：ret == 1时，表示充值成功
***********************************/
int Card_deduct_money(unsigned char* g_ucTempbuf,int money)
{
	int ret= 0;
	u8 status = 0;
	u8 raw_money[16];
	int i = 0;
	int temp = 0;
	
	PcdReset();
	while(Card_Look_Balance(g_ucTempbuf) != 1);		//将卡内余额读出
	for(i=0;i<4;i++)		//金额用到4字节
	{
		raw_money[i]=g_ucTempbuf[i];
		printf("%X",raw_money[i]);
	}	
	
	printf("\r\n");
	
	//数据处理,将读到的数据转换为一个32位的int型整数
	temp = raw_money[3];//将最高字节给temp
	temp <<= 8;			//temp左移8位
	temp |= raw_money[2];
	temp <<= 8;
	temp |= raw_money[1];
	temp <<= 8;
	temp |= raw_money[0];
	
	//数据已经还原,减去扣取金额
	temp -= money;
	
	//又将数据还原成4字节大小的char型数组
	raw_money[0] = 0xff & temp;
	temp >>= 8;
	raw_money[1] = 0xff & temp;
	temp >>= 8;
	raw_money[2] = 0xff & temp;
	temp >>= 8;
	raw_money[3] = 0xff & temp;
	
	//将数组没用用到的12字节配置为0
	for(i = 4;i < 16;i++)
	{
		raw_money[i] = 0;
	}
	
	//将数据写到块1中
	status = PcdWrite(2, raw_money);	//将金额写入块2
	if(status==0)
	{
		ret = 1;

	}
	else
	{
		ret = -1;
	
	}
	
	return ret;
}


/***********************************************************
**函数功能：查看余额
**参		数：g_ucTempbuf---------卡片类型代码
**					读成功后，余额值存放在g_ucTempbuf中，及时读取即可
**返回	值：ret == 1时，表示充值成功
***********************************************************/
int Card_Look_Balance(unsigned char* g_ucTempbuf)
{
	int ret = 0;
	u8 status  = 0;
	
	status = Card_handle(g_ucTempbuf,NULL);//扫描卡等等
	if(status == 5)		//只有扫描成功······一直到密码验证成功，才进行信息的写入
	{
		status = PcdRead(0x02, g_ucTempbuf);//读块2
		if(status==0)
		{
			ret = 1;
			printf("read成功\r\n");
		}
		else
		{
			ret = -1;
			printf("read失败\r\n");
		}
	}
	
	return ret;
}


/**********************************
**函数功能：读出用户编号
**					从扇区0块1中读取
**参		数：g_ucTempbuf---------卡片类型代码
**					读成功后，用户编号存放在g_ucTempbuf中，及时读取即可
**返回	值：ret == 1时，表示充值成功
**********************************/
int Card_Look_User(unsigned char* g_ucTempbuf)
{
	int ret = 0;
	u8 status  = 0;
	
	status = Card_handle(g_ucTempbuf,NULL);//扫描卡等等
	if(status == 5)		//只有扫描成功······一直到密码验证成功，才进行信息的写入
	{
		status = PcdRead(0x01, g_ucTempbuf);//读块1
		if(status==0)
		{
			ret = 1;
		}
		else
		{
			ret = -1;
		}
	}
	
	return ret;
}



int Write_Card(unsigned char* g_ucTempbuf)
{
	int ret= 0;
	u8 status = 0;

	//将数据写到块1中
	status = PcdWrite(1, g_ucTempbuf);	//将金额写入块2
	if(status==0)
	{
		ret = 1;
		printf("充值成功\r\n");
	}
	else
	{
		ret = -1;
	}
	
	return ret;
}


int Write_Card2(unsigned char* g_ucTempbuf)
{
	int ret= 0;
	u8 status = 0;

	//将数据写到块1中
	status = PcdWrite(1, g_ucTempbuf);	//将金额写入块2
	if(status==0)
	{
		ret = 1;
		printf("扣款成功\r\n");
	}
	else
	{
		ret = -1;
	}
	
	return ret;
}




